In [1]:
import pandas as pd

# 텍스트 파일

In [2]:
pd.read_csv('data/geeks.csv')

       이름                  직업     국적            트위터         생년월일
0     이성주   컴퓨터 프로그래머/데이터 과학자   대한민국   @LeeSeongjoo   1982-12-27
1  Rossum           컴퓨터 프로그래머   네덜란드    @gvanrossum   1956-01-31
2  Turing              컴퓨터과학자     영국            NaN   1912-06-23

텍스트 파일은 *반드시* 인코딩이 설정되어 있습니다.

In [4]:
pd.read_csv('data/geeks_cp949.txt', encoding='cp949')

       이름                  기술     국적            트위터         생년월일
0     이성주   컴퓨터 프로그래머/데이터 과학자   대한민국   @LeeSeongjoo   1982-12-27
1  Rossum           컴퓨터 프로그래머   네덜란드    @gvanrossum   1956-01-31
2  Turing              컴퓨터과학자     영국            NaN   1912-06-23

In [5]:
pd.read_csv?

In [8]:
pd.read_csv(
    'data/geeks_no_header.csv', encoding='utf8',
    #header=None,
    names=['이름', '직업', '국적', '트위터', '생년월일']
)

       이름                  직업     국적            트위터         생년월일
0     이성주   컴퓨터 프로그래머/데이터 과학자   대한민국   @LeeSeongjoo   1982-12-27
1  Rossum           컴퓨터 프로그래머   네덜란드    @gvanrossum   1956-01-31
2  Turing              컴퓨터과학자     영국            NaN   1912-06-23

In [10]:
pd.read_csv(
    'data/geeks.csv', encoding='utf8',
    index_col='이름'
)

                        직업     국적            트위터         생년월일
이름
이성주      컴퓨터 프로그래머/데이터 과학자   대한민국   @LeeSeongjoo   1982-12-27
Rossum           컴퓨터 프로그래머   네덜란드    @gvanrossum   1956-01-31
Turing              컴퓨터과학자     영국            NaN   1912-06-23

In [12]:
pd.read_csv(
    'data/pydata-book/movielens/users.dat',
    sep='::', engine='python'
)[:5]

   1  F  1.1  10  48067
0  2  M   56  16  70072
1  3  M   25  15  55117
2  4  M   45   7  02460
3  5  M   25  20  55455
4  6  F   50   9  55117

In [14]:
pd.read_csv('data/commented.txt', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
frame = pd.read_csv('data/commented.txt', comment='#')

In [18]:
frame.to_csv('no-commented.txt', sep=':')

저장할 때, "엑셀이냐 텍스트 파일이냐?"

엑셀: 편리하죠.  
텍스트파일: 백 만개 이상도 저장할 수 있습니다.

### "빅" 파일 다루기

In [19]:
pd.read_csv('data/pydata-book/us_presidental.csv', nrows=5)

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,250,20-JUN-11,NaN,NaN,NaN,SA17A,736166
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,50,23-JUN-11,NaN,NaN,NaN,SA17A,736166
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,368633403,INFORMATION REQUESTED,INFORMATION REQUESTED,250,05-JUL-11,NaN,NaN,NaN,SA17A,749073
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,724548253,NONE,RETIRED,250,01-AUG-11,NaN,NaN,NaN,SA17A,749073
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,719016467,NONE,RETIRED,300,20-JUN-11,NaN,NaN,NaN,SA17A,736166

In [19]:
pd.read_csv('data/pydata-book/us_presidental.csv')[:5]

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,250,20-JUN-11,NaN,NaN,NaN,SA17A,736166
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,366010290,RETIRED,RETIRED,50,23-JUN-11,NaN,NaN,NaN,SA17A,736166
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,368633403,INFORMATION REQUESTED,INFORMATION REQUESTED,250,05-JUL-11,NaN,NaN,NaN,SA17A,749073
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,724548253,NONE,RETIRED,250,01-AUG-11,NaN,NaN,NaN,SA17A,749073
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,719016467,NONE,RETIRED,300,20-JUN-11,NaN,NaN,NaN,SA17A,736166

In [20]:
chunker = pd.read_csv(
    'data/pydata-book/us_presidental.csv', chunksize=1000)

In [21]:
for chk in chunker:
    print(chk.info())
    break

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
cmte_id              1000 non-null object
cand_id              1000 non-null object
cand_nm              1000 non-null object
contbr_nm            1000 non-null object
contbr_city          1000 non-null object
contbr_st            1000 non-null object
contbr_zip           997 non-null float64
contbr_employer      996 non-null object
contbr_occupation    996 non-null object
contb_receipt_amt    1000 non-null float64
contb_receipt_dt     1000 non-null object
receipt_desc         7 non-null object
memo_cd              2 non-null object
memo_text            7 non-null object
form_tp              1000 non-null object
file_num             1000 non-null int64
dtypes: float64(2), int64(1), object(13)
memory usage: 125.1+ KB
None

## 엑셀파일

In [22]:
경로 = 'data/koreaexim/international/Global+Market+Daily+Table%28%EA%B0%92%EB%B3%B5%EC%82%AC%29_0803.xls'

In [26]:
프레임 = pd.read_excel(
    경로, skiprows=3, parse_cols='C:K', header=None)

In [30]:
프레임 = 프레임.dropna(how='all')

In [35]:
프레임 = 프레임.reset_index(drop=True)

In [37]:
프레임[0:8]

,0,1,2,3,4,5,6,7,8
0,Equity,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Last Price,D-1,D-7,MTD,QTD,YTD,Yr High,Yr Low
2,MSCI AC World,425.32,-0.00342097,0.0141638,-0.00342097,-0.00561115,0.0196586,442.7,392.13
3,S&P 500,2098.04,-0.00275686,0.0147028,-0.00275686,0.0150366,0.0190102,2130.82,1862.49
4,Euro Stoxx 50,3635.4,0.00963982,0.0348126,0.00963982,-0.0214978,0.155405,3828.78,2874.65
5,DAX,11443.7,0.0119135,0.0350313,0.0119135,-0.0437581,0.167066,12374.7,8571.95
6,Nikkei 225,20548.1,-0.00180372,0.00973017,-0.00180372,0.0572691,0.17749,20868,14532.5
7,상해,3622.91,-0.0111417,-0.0275537,-0.0111417,-0.062378,0.120021,5166.35,2187.67

In [39]:
프레임[8:16]

,0,1,2,3,4,5,6,7,8
8,Fixed Income,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,Last Price(%),D-1,D-7,MTD,QTD,YTD,Yr High,Yr Low
10,UST 10Y,2.148,-3,-6.95,-3.21,30.91,-2.32,2.6198,1.6407
11,UST 2Y,0.6646,0,1.51,0.4,18.84,0.01,0.7393,0.3076
12,Spread(10Y-2Y),1.4834,-3,-8.46,-3.61,12.07,-2.33,2.0562,1.1919
13,Bund 10Y,0.628,-1,-6.3,-1.6,43.4,8.7,1.167,0.075
14,Bund 2Y,-0.244,0,-1.8,-0.9,1.3,-13.4,0.027,-0.283
15,Spread(10Y-2Y),0.872,-1,-4.5,-0.7,42.1,22.1,1.157,0.342

In [53]:
def 지표추출(프레임):
    표범위목록 = [(0, 8), (8, 16), (16, 23), (24, 29), (29, 44)]
    표목록 = []
    for 범위 in 표범위목록:
        시작, 끝 = 범위
        표 = 프레임[시작:끝]
        표목록.append(표)
    return 표목록

In [54]:
표목록 = 지표추출(프레임)

엑셀 파일 쓰기

In [66]:
def 엑셀로내보내기(표목록, 파일명):
    엑셀파일 = pd.ExcelWriter(파일명)

    for i, 표 in enumerate(표목록):
        표.to_excel(엑셀파일, '지표 {}'.format(i+1))

    엑셀파일.save()

In [67]:
엑셀로내보내기(표목록, '지표 1.xlsx')

기본적으로 첫 번째 시트만 읽어옵니다.

sheetname을 설정합니다.

In [62]:
전체지표 = pd.read_excel('지표1.xlsx', sheetname=None)

In [65]:
전체지표['지표 1']

,0,1,2,3,4,5,6,7,8
0,Equity,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Last Price,D-1,D-7,MTD,QTD,YTD,Yr High,Yr Low
2,MSCI AC World,425.32,-0.00342097,0.0141638,-0.00342097,-0.00561115,0.0196586,442.7,392.13
3,S&P 500,2098.04,-0.00275686,0.0147028,-0.00275686,0.0150366,0.0190102,2130.82,1862.49
4,Euro Stoxx 50,3635.4,0.00963982,0.0348126,0.00963982,-0.0214978,0.155405,3828.78,2874.65
5,DAX,11443.7,0.0119135,0.0350313,0.0119135,-0.0437581,0.167066,12374.7,8571.95
6,Nikkei 225,20548.1,-0.00180372,0.00973017,-0.00180372,0.0572691,0.17749,20868,14532.5
7,상해,3622.91,-0.0111417,-0.0275537,-0.0111417,-0.062378,0.120021,5166.35,2187.67

모든 대상 파일에 현재 작업을 적용하기

In [1]:
import os

대상 파일 경로 구성

In [2]:
대상파일목록 = []
폴더 = 'data/koreaexim/international/'
for 항목 in os.listdir(폴더):    
    경로 = os.path.join(폴더, 항목)
    대상파일목록.append(경로)

In [73]:
대상파일목록[:3]

['data/koreaexim/international/Global+Market+Daily+Table%28%EA%B0%92%EB%B3%B5%EC%82%AC%29_0803.xls',
 'data/koreaexim/international/Global+Market+Daily+Table%28%EA%B0%92%EB%B3%B5%EC%82%AC%29_0804.xls',
 'data/koreaexim/international/Global+Market+Daily+Table%28%EA%B0%92%EB%B3%B5%EC%82%AC%29_0805.xls']

In [3]:
import exim

if not os.path.exists('output'):
    os.makedirs('output')
    
for i, 경로 in enumerate(대상파일목록):    
    # 1. 표 추출
    표목록 = exim.지표추출(경로)
    # 2. 결과 엑셀 파일로 저장
    결과파일 = os.path.join('output', '지표 {}.xlsx'.format(i+1))
    exim.엑셀로내보내기(표목록, 결과파일)

In [90]:
시작목록 = list(프레임[프레임.notnull().sum(1) == 1].index)
시작목록

[0, 8, 16, 23, 24, 29]

In [91]:
끝목록 = 시작목록[1:] + [len(프레임)]
끝목록

[8, 16, 23, 24, 29, 44]

In [92]:
list(zip(시작목록, 끝목록))

[(0, 8), (8, 16), (16, 23), (23, 24), (24, 29), (29, 44)]